Autodesk.Revit.DB.ICentralLockedCallback.ShouldWaitForLockAvailability
Returns whether Revit should wait and try again to acquire the lock on central.
Returns:
True means wait and try again later.  False means immediately give up.
Since:
2014

Autodesk.Revit.DB.ICentralLockedCallback
An interface that may be used to control Revit's behavior when it tries to lock central
and is blocked because another user already has locked central.
Since:
2014